app/Controllers/EmpleadoController.php

    function editContrato($id){
        $contratoModel = new ContratoModel();
        $empleadoModel = new EmpleadoModel();
        $empresaModel = new EmpresaModel();
        $data['id_empleado']= $id;
        $data['contrato'] = $contratoModel->where('id_empleado',$id)->get()->getResultObject();
        if(count($data['contrato'])>0){
            $empleado = $empleadoModel->find($id);
            $data['empresa'] = $empresaModel->find($empleado->id_empresa);
---
SELECT *
FROM "contratos"
WHERE "id_empleado" = '3'
SELECT *
FROM "empleados"
WHERE "empleados"."id" = '3'
SELECT *
FROM "empresas"
WHERE "empresas"."id" = '1'